EchoWebLV/daemon-agent-device/sdkconfig.defaults
# -----------------------------------------------------------------------------
#  ESP-IDF sdkconfig defaults for Daemon.
#
#  Anything set here is applied on a fresh build. After the first build a full
#  `sdkconfig` is generated from these + IDF defaults; regenerate it by
#  deleting `.pio/build/<env>/sdkconfig` and rebuilding.
# -----------------------------------------------------------------------------

# ---- Target chip ------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash ------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- Custom partition table -------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM (8 MB octal-SPI on this board) -----------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Allocations smaller than this threshold go to internal RAM (fast); bigger
# ones fall through to PSRAM. 16 KB matches the Arduino-ESP32 default.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ---- CPU --------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ---- Console over native USB Serial/JTAG (no external chip on this board) --
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# ---- FreeRTOS ---------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ---- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# ---- LWIP — generous socket headroom ---------------------------------------
# Under combined load (httpd polling from the web UI + outbound HTTPS for
# AI POST + 1-2 Helius RPC sockets for blockhash/ATA + ElevenLabs TTS +
# wallet/price refresh) the default 10-socket pool wedges within 3-4
# /say calls. Each socket is a few hundred bytes of internal RAM, and
# we have ~200 KB free internal heap, so sizing generously is cheap.
CONFIG_LWIP_MAX_SOCKETS=24
CONFIG_LWIP_MAX_ACTIVE_TCP=24
CONFIG_LWIP_MAX_LISTENING_TCP=8

# Drop TCP TIME_WAIT from 60 s to 1.5 s. A closed outbound HTTPS socket
# normally squats a slot for the full MSL (60 s default). 1.5 s is safe
# on a private LAN with sub-200 ms round-trips.
CONFIG_LWIP_TCP_MSL=1500

# Keep-alive on the listening httpd socket so dead client connections
# (browser tab closed, phone went to sleep mid-poll) get reaped quickly
# instead of squatting accept slots until the kernel notices.
CONFIG_LWIP_TCP_KEEPIDLE_DEFAULT=60
CONFIG_LWIP_TCP_KEEPINTVL_DEFAULT=15
CONFIG_LWIP_TCP_KEEPCNT_DEFAULT=3
CONFIG_LWIP_SO_LINGER=y

# ---- mbedTLS (bigger record buffer so Gemini / ElevenLabs chunks fit) ------
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Route mbedTLS allocations to PSRAM instead of internal DRAM. With the
# 16 KB IN + 4 KB OUT record buffers above, *each* concurrent TLS handle
# needs ~25 KB of DRAM — and we have three talking at once (wallet RPC,
# Solana x402 chat, ElevenLabs TTS). Internal DRAM after Wi-Fi / LwIP /
# LVGL is ~220 KB, which is too tight: mbedtls_ssl_setup() starts
# returning -0x7F00 (MBEDTLS_ERR_SSL_ALLOC_FAILED) when they race at
# boot. PSRAM is fine for mbedTLS record buffers (crypto accelerators
# have their own DMA memory) and we have 8 MB of it to spare. Also flip
# on the dynamic RX/TX buffers so an idle SSL handle drops its 20 KB of
# record buffers until the next request.
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# ---- ESP-SR (wake word + VAD via AFE) --------------------------------------
# WakeNet9 placeholder. wn9_hiesp ("Hi ESP") is trained on English speakers
# and detects reliably for the demo without waiting on a custom model. Swap
# to `CONFIG_SR_WN_WN9_HEYDAEMON=y` (or whatever symbol the WakeNet generator
# returns) once the custom "Hey Daemon" model arrives. Both the Espressif
# customization process and third-party services (e.g. custom-espsr.com)
# produce compatible WN9 models.
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_VADN_VADNET1_MEDIUM=y

# ---- mbedTLS hardware AES + GCM OFF ----------------------------------------
# Hardware AES on ESP32-S3 allocates DMA-capable internal-RAM buffers per
# encrypt block. Combined with esp-sr's AFE working buffers (which also
# need internal RAM), the AES DMA alloc routinely fails:
#   esp-aes: Failed to allocate memory
#   esp-tls-mbedtls: write error :-0x0001
# on every TLS handshake (STT POST, x402 chat, ElevenLabs TTS). Software
# AES at 240 MHz is fast enough for our payloads and uses plain heap that
# PSRAM-backed mbedTLS satisfies. HARDWARE_GCM depends on the same DMA
# path, so disable it too.
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_GCM=n

# ---- LVGL extras -----------------------------------------------------------
# QR code lib: wallet screen renders the device pubkey as a QR so a phone
# wallet can scan it without typing 44 base58 chars.
CONFIG_LV_USE_QRCODE=y

# Allocator: route LVGL through libc malloc instead of LVGL's built-in TLSF
# pool. The built-in pool defaults to a small fixed size and was choking on
# wifi-screen redraws (long mapping_search walks under task watchdog), and
# the system heap has access to all of PSRAM via heap_caps so there's no
# practical pressure on LVGL allocations from the bigger screens.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
